Revit 2027 API
StairsRunType.RiserToTreadConnect Property
 The connection of the riser to tread in relation to each other.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RiserToTreadConnectionOption RiserToTreadConnect { get; set; }
Public Property RiserToTreadConnect As RiserToTreadConnectionOption
	Get
	Set
public:
property RiserToTreadConnectionOption RiserToTreadConnect {
	RiserToTreadConnectionOption get ();
	void set (RiserToTreadConnectionOption value);
}
member RiserToTreadConnect : RiserToTreadConnectionOption with get, set
Property Value
RiserToTreadConnectionOption
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: The run type has no riser so the data being set is not applicable.
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace